
  #### Terraform Plan
  <details>
    <summary>Expand</summary>
    <pre>Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/timovink/infra-shared/runs/run-Lsb62KJytwGebPoa

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
module.iam.aws_iam_group.administrators: Refreshing state... [id=administrators]
module.iam.aws_iam_user.deployer: Refreshing state... [id=deployer]
module.dns["timovink.com"].aws_route53_zone.this: Refreshing state... [id=ZFMCDCUJ8UCFO]
module.dns["timovink.app"].aws_route53_zone.this: Refreshing state... [id=Z090672659X2JIXVUFX0]
module.iam.aws_iam_user.tvink: Refreshing state... [id=tvink]
module.dns["timovink.dev"].aws_route53_zone.this: Refreshing state... [id=Z09071302Y5GD83DY6NXW]
module.dns["timovink.ca"].aws_route53_zone.this: Refreshing state... [id=Z08658091IB2VPYFZRTIS]
module.iam.aws_iam_group_policy_attachment.administrators: Refreshing state... [id=administrators-20220605021751233100000001]
module.iam.aws_iam_user_group_membership.deployer: Refreshing state... [id=terraform-20220604232226591200000002]
module.iam.aws_iam_user_group_membership.tvink: Refreshing state... [id=terraform-20220605021751235700000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.global_certificate["timovink.app"].aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "timovink.app"
      + domain_validation_options = [
          + {
              + domain_name           = "*.timovink.app"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "timovink.app"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.timovink.app",
          + "timovink.app",
        ]
      + tags_all                  = {
          + "Project" = "tv-sharedinfra"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.global_certificate["timovink.app"].aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.global_certificate["timovink.app"].aws_route53_record.validation["*.timovink.app"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z090672659X2JIXVUFX0"
    }

  # module.global_certificate["timovink.app"].aws_route53_record.validation["timovink.app"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z090672659X2JIXVUFX0"
    }

  # module.global_certificate["timovink.ca"].aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "timovink.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "*.timovink.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "timovink.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.timovink.ca",
          + "timovink.ca",
        ]
      + tags_all                  = {
          + "Project" = "tv-sharedinfra"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.global_certificate["timovink.ca"].aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.global_certificate["timovink.ca"].aws_route53_record.validation["*.timovink.ca"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z08658091IB2VPYFZRTIS"
    }

  # module.global_certificate["timovink.ca"].aws_route53_record.validation["timovink.ca"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z08658091IB2VPYFZRTIS"
    }

  # module.global_certificate["timovink.com"].aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "timovink.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.timovink.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "timovink.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.timovink.com",
          + "timovink.com",
        ]
      + tags_all                  = {
          + "Project" = "tv-sharedinfra"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.global_certificate["timovink.com"].aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.global_certificate["timovink.com"].aws_route53_record.validation["*.timovink.com"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "ZFMCDCUJ8UCFO"
    }

  # module.global_certificate["timovink.com"].aws_route53_record.validation["timovink.com"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "ZFMCDCUJ8UCFO"
    }

  # module.global_certificate["timovink.dev"].aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "timovink.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "*.timovink.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "timovink.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.timovink.dev",
          + "timovink.dev",
        ]
      + tags_all                  = {
          + "Project" = "tv-sharedinfra"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.global_certificate["timovink.dev"].aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.global_certificate["timovink.dev"].aws_route53_record.validation["*.timovink.dev"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z09071302Y5GD83DY6NXW"
    }

  # module.global_certificate["timovink.dev"].aws_route53_record.validation["timovink.dev"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z09071302Y5GD83DY6NXW"
    }

  # module.local_certificate["timovink.app"].aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "timovink.app"
      + domain_validation_options = [
          + {
              + domain_name           = "*.timovink.app"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "timovink.app"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.timovink.app",
          + "timovink.app",
        ]
      + tags_all                  = {
          + "Project" = "tv-sharedinfra"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.local_certificate["timovink.app"].aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.local_certificate["timovink.app"].aws_route53_record.validation["*.timovink.app"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z090672659X2JIXVUFX0"
    }

  # module.local_certificate["timovink.app"].aws_route53_record.validation["timovink.app"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z090672659X2JIXVUFX0"
    }

  # module.local_certificate["timovink.ca"].aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "timovink.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "*.timovink.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "timovink.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.timovink.ca",
          + "timovink.ca",
        ]
      + tags_all                  = {
          + "Project" = "tv-sharedinfra"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.local_certificate["timovink.ca"].aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.local_certificate["timovink.ca"].aws_route53_record.validation["*.timovink.ca"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z08658091IB2VPYFZRTIS"
    }

  # module.local_certificate["timovink.ca"].aws_route53_record.validation["timovink.ca"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z08658091IB2VPYFZRTIS"
    }

  # module.local_certificate["timovink.com"].aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "timovink.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.timovink.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "timovink.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.timovink.com",
          + "timovink.com",
        ]
      + tags_all                  = {
          + "Project" = "tv-sharedinfra"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.local_certificate["timovink.com"].aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.local_certificate["timovink.com"].aws_route53_record.validation["*.timovink.com"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "ZFMCDCUJ8UCFO"
    }

  # module.local_certificate["timovink.com"].aws_route53_record.validation["timovink.com"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "ZFMCDCUJ8UCFO"
    }

  # module.local_certificate["timovink.dev"].aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "timovink.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "*.timovink.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "timovink.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.timovink.dev",
          + "timovink.dev",
        ]
      + tags_all                  = {
          + "Project" = "tv-sharedinfra"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.local_certificate["timovink.dev"].aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.local_certificate["timovink.dev"].aws_route53_record.validation["*.timovink.dev"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z09071302Y5GD83DY6NXW"
    }

  # module.local_certificate["timovink.dev"].aws_route53_record.validation["timovink.dev"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z09071302Y5GD83DY6NXW"
    }

Plan: 32 to add, 0 to change, 0 to destroy.

</pre>
  </details>
